# 返回两个AU
import sys
import random
import io
sys.stdout = io.TextIOWrapper(sys.stdout.detach(), encoding='utf-8')

mylist = ['人鱼', '吸血鬼', '赛博朋克', '丧尸', '龙', '社畜', '武侠',
          '一方变成小孩子', '校园', '模特', '古风', 'ABO', '公路', 'HP',
          '电子竞技', '女装攻', '原作', '一方长出了猫耳', '普通地一起吃饭',
          '花吐，但吐的是六合彩', '前辈和后辈的关系', '言辞犀利的仿生人',
          '木讷的机器人', '大家去外星研究阿凡达', '星际海盗',
          '一日男友', '激烈地做爱', '演员', '片警', '偶尔尝试一下群像也不错？',
          '我也想不出来', '只有处男才有猫耳的那个动画片是什么来着',
          '神奇动物在我的楼顶', '超级英雄', '队里有一个人是O究竟是谁呢',
          '酒后乱性', '变成狗了', '接吻就会交换运气',
          '阿伯汤面小店里拼桌的陌生人', '驯龙高手', '古惑仔/太妹',
          '淫纹', 'Cake & Fork', '便利店收银的魅魔', '一方长出了翅膀', '地下偶像',
          '刑侦', '深藏不露的天师', '童贞魔法师', '三角关系',
          '灵魂伴侣', '欢喜冤家', '一夜情过后发现对方是自己的老师',
          '哼，“别人家的孩子”也不过如此', '老子最喜欢直男了',
          '不做爱就不能出去的房间', '月圆之夜发现对方也是狼人',
          '别装了，那个迷情剂其实是葡萄糖水', '车震', 'phone sex', '白天不共戴天，晚上睡一张床', '强迫穿jk制服', '身体互换', '工作狂编辑和拖更作者', '一方变成毛绒玩具']

# 保证两个AU不重合
flag1 = random.randint(0, len(mylist)-1)
while True:
    flag2 = random.randint(0, len(mylist)-1)
    if flag2 != flag1:
        break
print(mylist[flag1] + " + " + mylist[flag2])
