# 返回两个AU
import sys
import random
import io
sys.stdout = io.TextIOWrapper(sys.stdout.detach(), encoding='utf-8')

mn1 = ['白金','深红','忧郁','紫色','绿色','银色','黄金',
'暗蓝','黑檀木','黄色','倒吊','男','女','命运',
'死','疯狂','水','轰炸','极恶','饥饿','珍珠',
'透明','天堂','杀手','原子心','大地','公路','迷途',
'黄金','黑色','性感','镜','总裁','海滩','壮烈',
'白色','脸部','青春','雨天','永恒','恒星','狂躁',
'石','曼哈顿','地狱','讨债','怒海','流浪','地狱'
'波西米亚','骇客','聆听','沉默','湿润','巧克力','加州',
'派对','教会','蓝色','纸月','酒精','机械','杜比',
'狗狗','臭氧','琥珀','大众','神','瓶中','野性',
'咸度','迷失','手部','六眼','呼吸','神','无','缺德','出走']

mn2=['之星','世界','隐者','塔','魔术师','法皇','战车',
'之月','恶魔','天使','节制','帝','轮','正义','钢琴',
'审判','愚者','瘴气','萨克斯','钻石','项链','空间',
'中队','辣椒','锁','音','恋人','果酱','宝石',
'攻击','手枪','姑娘','儿童','之门','之母','拍档',
'猫','飞人','迷雾','体验','手指','安息日','蓝调',
'机器','工作','女士','成仁','相簿','之王','妹',
'岁月','制品','匕首','抑郁','自由','传送阵','蛇',
'之吻','之火','之雨','龙','任务','站台','兽',
'旅行者','领域','之道','山','纹身','战争',
'行为','公园','大床','挚爱','之心',
'风格','风暴','博士']

ml1 = ['A','B','C','D','E']
ml2 = ['A','B','C','D','E','∞']

return_string = ''

flag1 = random.randint(0,len(mn1)-1)
flag2 = random.randint(0,len(mn2)-1)
return_string += '名：【'+mn1[flag1]+mn2[flag2]+'】\n'

flag = random.randint(0,len(ml1)-1)
return_string += '破坏力：' + ml1[flag] + '\n'
flag = random.randint(0,len(ml2)-1)
return_string += '速度：' + ml2[flag]+ '\n'
flag = random.randint(0,len(ml2)-1)
return_string +='射程距离：' + ml2[flag]+ '\n'
flag = random.randint(0,len(ml1)-1)
return_string +='持续性：' + ml2[flag]+ '\n'
flag = random.randint(0,len(ml2)-1)
return_string +='精密动作性：' + ml2[flag]+ '\n'
flag = random.randint(0,len(ml1)-1)
return_string +='成长性：' + ml1[flag]+ '\n'

print(return_string)