import sys
import random
import io
sys.stdout = io.TextIOWrapper(sys.stdout.detach(), encoding='utf-8')

time_period = ['一周','两小时','三十分钟','五天','两天','一天','十二小时','九十分钟','半个月','一个月']
ability = ['创造力','直觉','洞察力','运动能力','幸运值','专注力','探索欲','快速反应能力','语言表达能力','记忆力',
'理解力','决策力','逻辑力','想象力','时间管理能力','艺术天赋','音乐天赋','绘画天赋','写作天赋',
'自信心','创新能力','社交力','意志力','理财力','空间感知力','游戏水平','批判思维力',
'遇到猫的概率','马路上捡到钱的概率','晒到刚刚好程度太阳的概率','吃到好吃小吃的概率','发现稀有物品的概率','乘坐公共交通车有座位的概率',
'健身效果显著的概率','获得工作升职的概率','遇到好人的概率','遇到好天气的概率','与好友保持联系的概率','完成目标的概率','获得好评的概率',
'与偶像相遇的概率','喜欢的东西打折的概率','发现美味新餐厅的概率','获得生活中意外惊喜的概率','获得意外收入的概率',
'成功完成自己之前不会做的事情的概率','掌握新技能的概率','成功克服困难的概率','拉到郎的概率','磕到cp的概率','正主卖腐的概率','抢到票的概率',
'喜欢的游戏打折的概率','遇到狗的概率','遇到麻雀的概率',
'变成狼人的概率','变成吸血鬼的概率','变成侦探的概率','变成龙的概率','变成海盗的概率','变成超级英雄的概率','变成时间旅行者的概率',
'变成魔法师的概率','变成世界首富的概率','变成宇航员的概率','变成赛博坦人的概率']
flag1 = random.randint(0, len(time_period)-1)
flag2 = random.randint(0, len(ability)-1)
flag3 = random.randint(1,10)
if flag3 > 9:
    score = random.randint(100,200)
elif flag3 > 6:
    score = random.randint(60,100)
else:
    score = random.randint(1,60)
print("接下来的"+ time_period[flag1]+"，"+ ability[flag2]+"将提升" + str(score) + "%！")